Protuberanec/stm32_2022/main.c
/*
******************************************************************************
File:     main.c
Info:     Generated by Atollic TrueSTUDIO(R) 9.3.0   2022-04-06

The MIT License (MIT)
Copyright (c) 2019 STMicroelectronics

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

******************************************************************************
*/

/* Includes */
#include "stm32f0xx.h"


//#define USART_DMA
//#define SIMPLE_USART
#define ADC_LESSON

uint8_t byteRx;

void adc_init_cont();
void bufferPutToEnd() {

}

/*
 * input		:
 * 	output		:
 * 	description	:
 * 	author		:
 * 	version		:
 * 	date		:
 */
int bufferIsEmpty() {}

uint8_t bufferGetDataFromBegin() {}

void USART1_IRQHandler() {
	if ((USART1->ISR & USART_ISR_TXE) == USART_ISR_TXE) {
		static uint8_t byte = 0;
		USART1->TDR = byte++;
	}

	if ((USART1->ISR & USART_ISR_RXNE) == USART_ISR_RXNE) {
		byteRx = USART1->RDR;
		bufferPutToEnd();
	}
}

void DMA1_Channel2_3_IRQHandler(void) {
	//0. какой канал контроллера DMA
	//1. какое прерывание half, full, error
	if ( (DMA1->ISR & DMA_ISR_TCIF2) == DMA_ISR_TCIF2)  {
		DMA1->IFCR |= DMA_IFCR_CTCIF2;
		//перенастроить DMA контроллер....  или что-то сделать...
	}
}

/*
 * 	PA9 - usart 1 TX
 * 	PA10 - usart 1 RX
 */
void init_gpio_as_AF_for_usart() {
	//1
	RCC->AHBENR |= RCC_AHBENR_GPIOAEN;
	//2
	GPIOA->MODER |= GPIO_MODER_MODER9_1 | GPIO_MODER_MODER10_1;
	GPIOA->AFR[1] |=  (1 << 4)|(1 << 8);	//AF1

	//3 - turn on peripheral...
}

uint16_t data_adc[2];

void init_usart1() {

	//0 (3)
	init_gpio_as_AF_for_usart();
	//1
	RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
	//2

	USART1->CR1 |= USART_CR1_RE;	//enable receive
	USART1->CR1 |= USART_CR1_TE;	//transmit enable
	USART1->CR2 &= ~USART_CR2_STOP;	//1 stop bit

//init interruption
#ifndef NO_USART_INTERRUPT
//	USART1->CR1 |= USART_CR1_TXEIE;
	USART1->CR1 |= USART_CR1_RXNEIE;
#endif
	USART1->BRR = SystemCoreClock / 115200;
	//4
	USART1->CR1 |= USART_CR1_UE;

#ifndef NO_USART_INTERRUPT
	NVIC_SetPriority(USART1_IRQn, 2);
	NVIC_EnableIRQ(USART1_IRQn);
#endif
}

void ADC1_COMP_IRQHandler(void) {
	if ((ADC1->ISR & ADC_ISR_EOSEQ) == ADC_ISR_EOSEQ) {
		ADC1->ISR |= ADC_ISR_EOSEQ;
	}

	if ((ADC1->ISR & ADC_ISR_EOC) == ADC_ISR_EOC) {
		data_adc[0] = ADC1->DR;
	}
}

uint8_t put_char_usart1(uint8_t byte) {
	if ((USART1->ISR & USART_ISR_TXE) == USART_ISR_TXE)
	{
		USART1->TDR = byte;
		return 1;
	}
	return 0;
}

uint32_t data[256];

void init_usart_dma() {

	for (int i = 0; i < 256; i++) {
		data[i] = i;
	}

//0 (3)
	init_gpio_as_AF_for_usart();
	//1
	RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
	//2

	USART1->CR1 |= USART_CR1_RE;	//enable receive
	USART1->CR1 |= USART_CR1_TE;	//transmit enable
	USART1->CR2 &= ~USART_CR2_STOP;	//1 stop bit

	USART1->BRR = SystemCoreClock / 115200;
	USART1->CR3 |= USART_CR3_DMAT;	//allow usart to work via DMA


	RCC->AHBENR |= RCC_AHBENR_DMA1EN;
	DMA1_Channel2->CPAR = (uint32_t)(&(USART1->TDR));
	DMA1_Channel2->CMAR = (uint32_t)(&data[0]);
	DMA1_Channel2->CNDTR = 256;
	DMA1_Channel2->CCR |= DMA_CCR_TCIE;	//interruption
	DMA1_Channel2->CCR |= DMA_CCR_DIR;	//read from memory
	DMA1_Channel2->CCR |= DMA_CCR_MINC;
//	DMA1_Channel2->CCR |= DMA_CCR_PSIZE | DMA_CCR_MSIZE;	size of data

	NVIC_SetPriority(DMA1_Channel2_3_IRQn, 9);
	NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);


	DMA1_Channel2->CCR |= DMA_CCR_EN;
	//4
	USART1->CR1 |= USART_CR1_UE;
}

void processBuffer() {
	if (bufferIsEmpty()) {
		return;
	}

	uint8_t tempByte = bufferGetDataFromBegin();


}

void workUsart() {
#ifdef NO_USART_INTERRUPT
		if (put_char_usart1(byte) == 1) {
			byte++;
		}
#endif
		if (byteRx == 0xA1) {
			GPIOC->ODR ^= GPIO_ODR_8;
			byteRx = 0x00;
		}
}

void blinkLed() {}


int main(void)
{
	RCC->AHBENR |= RCC_AHBENR_GPIOCEN;
	GPIOC->MODER |= GPIO_MODER_MODER8_0;	//LED output
#ifdef SIMPLE_USART
	init_usart1();
#endif
#ifdef USART_DMA
	init_usart_dma();
#endif
#ifdef NO_USART_INTERRUPT
	uint8_t byte = 0;
#endif

#ifdef ADC_LESSON
	adc_init_cont();
	adc_start();
#endif

	while (1)
	{
#ifdef SIMPLE_USART
		workUsart();
		processBuffer();
		blinkLed();
#endif
#ifdef ADC_LESSON

#endif

	}
}


void adc_init_cont() {
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;
	RCC->CR2 |= RCC_CR2_HSI14ON;

	ADC1->CHSELR = ADC_CHSELR_CHSEL0;// | ADC_CHSELR_CHSEL1;	//adc_in0 - pa0, adc_in1 - pa1
	RCC->AHBENR |= RCC_AHBENR_GPIOAEN;
	GPIOA->MODER |= GPIO_MODER_MODER0 /*GPIO_MODER_MODER0_0 | GPIO_MODER_MODER0_1*/ |
					GPIO_MODER_MODER1;	//analog function for pa0, pa1

	ADC1->IER |= ADC_IER_EOCIE;
	ADC1->IER |= ADC_IER_EOSEQIE;
	NVIC_SetPriority(ADC1_COMP_IRQn, 5);
	NVIC_EnableIRQ(ADC1_COMP_IRQn);

	ADC1->CFGR1 |= ADC_CFGR1_CONT;

	ADC1->CR |= ADC_CR_ADEN;
}

void adc_start() {
	ADC1->CR |= ADC_CR_ADSTART;
}

void adc_stop() {
	ADC1->CR |= ADC_CR_ADSTP;
}
